; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	image0 - mode
	spectrograph3 - mode
	spectrograph5 - mode
	spectrograph2 - mode
	thermograph1 - mode
	spectrograph4 - mode
	GroundStation0 - direction
	Star4 - direction
	Star5 - direction
	GroundStation3 - direction
	Star2 - direction
	GroundStation1 - direction
	Phenomenon6 - direction
	Star7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 spectrograph3)
	(supports instrument0 spectrograph5)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon6)
	(supports instrument1 spectrograph4)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 Star4)
	(supports instrument2 spectrograph2)
	(supports instrument2 spectrograph5)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 Star5)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument4 spectrograph4)
	(calibration_target instrument4 Star2)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 spectrograph2)
	(supports instrument5 thermograph1)
	(supports instrument5 spectrograph3)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon12)
)
(:goal (and
	(have_image Phenomenon6 image0)
	(have_image Star7 spectrograph2)
	(have_image Star7 spectrograph3)
	(have_image Star8 image0)
	(have_image Phenomenon9 spectrograph3)
	(have_image Phenomenon10 thermograph1)
	(have_image Planet11 spectrograph4)
	(have_image Phenomenon12 spectrograph5)
	(have_image Phenomenon12 spectrograph3)
	(have_image Star13 spectrograph4)
	(have_image Star13 image0)
))

)

; plan
1. (turn_to satellite2 groundstation1 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 groundstation1)
   goals met: 0 of 11
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 11
3. (calibrate satellite2 instrument5 groundstation1)
   added: (calibrated instrument5)
   goals met: 0 of 11
4. (turn_to satellite2 star7 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 star7)
   goals met: 0 of 11
5. (turn_to satellite1 groundstation1 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 groundstation1)
   goals met: 0 of 11
6. (turn_to satellite0 star2 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star2)
   goals met: 0 of 11
7. (take_image satellite2 star7 instrument5 spectrograph3)
   added: (have_image star7 spectrograph3)
   goals met: 1 of 11
8. (take_image satellite2 star7 instrument5 spectrograph2)
   added: (have_image star7 spectrograph2)
   goals met: 2 of 11
9. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 2 of 11
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 11
11. (calibrate satellite1 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 2 of 11
12. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 2 of 11
13. (turn_to satellite0 phenomenon12 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon12)
   goals met: 2 of 11
14. (take_image satellite0 phenomenon12 instrument0 spectrograph3)
   added: (have_image phenomenon12 spectrograph3)
   goals met: 3 of 11
15. (take_image satellite0 phenomenon12 instrument0 spectrograph5)
   added: (have_image phenomenon12 spectrograph5)
   goals met: 4 of 11
16. (turn_to satellite0 phenomenon9 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon9)
   goals met: 4 of 11
17. (take_image satellite0 phenomenon9 instrument0 spectrograph3)
   added: (have_image phenomenon9 spectrograph3)
   goals met: 5 of 11
18. (turn_to satellite1 planet11 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet11)
   goals met: 5 of 11
19. (take_image satellite1 planet11 instrument1 spectrograph4)
   added: (have_image planet11 spectrograph4)
   goals met: 6 of 11
20. (turn_to satellite1 star13 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 star13)
   goals met: 6 of 11
21. (take_image satellite1 star13 instrument1 spectrograph4)
   added: (have_image star13 spectrograph4)
   goals met: 7 of 11
22. (turn_to satellite2 phenomenon10 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 phenomenon10)
   goals met: 7 of 11
23. (take_image satellite2 phenomenon10 instrument5 thermograph1)
   added: (have_image phenomenon10 thermograph1)
   goals met: 8 of 11
24. (turn_to satellite2 phenomenon6 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 phenomenon6)
   goals met: 8 of 11
25. (take_image satellite2 phenomenon6 instrument5 image0)
   added: (have_image phenomenon6 image0)
   goals met: 9 of 11
26. (turn_to satellite2 star13 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 star13)
   goals met: 9 of 11
27. (take_image satellite2 star13 instrument5 image0)
   added: (have_image star13 image0)
   goals met: 10 of 11
28. (turn_to satellite2 star8 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 star8)
   goals met: 10 of 11
29. (take_image satellite2 star8 instrument5 image0)
   added: (have_image star8 image0)
   goals met: 11 of 11
